####Задача №1
####Необходимо, чтоб программа выводила на экран вот такую последовательность:
####7 14 21 28 35 42 49 56 63 70 77 84 91 98
##i = 7
##while i <= 98:
##    print(i, end = (' '))
##    i += 7


####Задача №2
####Необходимо вывести на консоль такую последовательность чисел:
####1 2 4 8 16 32 64 128 256 512
##i = 1
##while i <= 512:
##    print(i, end = (' '))
##    i += i


###6. В сберкассу на трёхпроцентный вклад положили S рублей.Какой станет сумма вклада через N лет.
##s = int(input())
##n = int(input())
##i = 1
##while i <= n:
##    s += s * 0.03
##    i += i
##print("через", n, "лет будет", i, "рублей")
    
###7. Ввести с клавиатуры 10 пар чисел. сравнить числа в каждой паре и напечатать большие из них.
##i = 1
##while i <= 10:
##    a = int(input())
##    b = int(input())
##    i += 1
##    if a > b:
##        print(a)
##    elif b > a:
##        print(b)



####8. Даны натуральные числа от 20 до 50.
####Напечатать те из них, которые делятся на 3,
####но не делятся на 5.
##i = 20
##while i <= 50:
##    i += 3
##    if i % 3:
##        print(i)
##    elif i % 5:
##        not print 
##    


#10. Даны натуральные числа от 1 до 50.
#Найти сумму тех из них, которые делятся на 5 или на 7.       
i = 20
while i <= 50:
    i += 3
    if i % 5 or i % 7:
        print
    else i % 3:
        not print








































